a = input()
punc = '''!()-—[] {};:'"\,<>./?@#$%^&*_№~«»'''
for ele in a:
	if ele in punc:
		a = a.replace(ele, "")
a = a.lower()
print(a)
if a==('васслышухорошо'):
    print('1.Vas_slishu_horosho')
elif a==('васпонялприступатькпроверкескафандрачерез3минутысейчасзанят'):
    print('2.Vas_Ponyal.Pristupat_k_proverke')
elif a==('проверкускафандразакончил'):
    print('3.Proverku_skafandra_zakonchil')
elif a==('какменяслышите'):
    print('4.Kak_manya_slishite')
elif a==('васслышуоченьслабоуменягоритсветозвуковаяпередачанадоскеочевиднопроисходитсписываниесмагнитофонакакменяпоняли'):
    print('5.Vas_slishu_ochen_slabo')
elif a==('васнепонялвыключитепожалуйстамузыкуеслиможно'):
    print('6.Vas_ne_ponyal.Vikluchite_muziku')
elif a==('всёсделанослышувасхорошо'):
    print('7.Vse_sdelano_slishu_vas_horosho')
elif a==('работаюнадэмшдэмшдинамическийэлектромагнитныймикрофоншлемадаюсчет12345678910'):
    print('8.Rabotau_na_DEMSH')
elif a==('васпонялпроверкасвязи12345678910какслышите'):
    print('9.Vas_ponyal_proverka_svayzi')
elif a==('работаюнамагнитофоне12345678910васслышухорошоработаюнадэмш12345678910какпоняли'):
    print('10.Rabotayu_na_magnitofone')
elif a==('приёмнателефон'):
    print('11.Priem_na_telefon')
elif a==('чувствуюсебяпревосходнопроверкателефоновидинамиковнормальноперехожунателефон'):
    print('12.Chuvstvuyu_sebya_prevoshodno')
elif a==('понялятакизнал'):
    print('13.Ponyal.Ya_tak_i_znal')
elif a==('понялвассовершенноспокоен'):
    print('14.Ponyal_vas.Sovershenno_spokoen')
elif a==('неслышалвёлвстречнуюпередачувсёвпорядкеговоритекакпоняли'):
    print('15.Ne_slishal.Vel_vstrechnuyu')
elif a==('какучилисмех'):
    print('16.Kak_uchili.Ha_ha_ha')
elif a==('понялландышсмехландышемназванкосмонавтпоповичпр'):
    print('17.Ponyal_landyish')
elif a==('васпонялсейчасвашезаданиевыполню'):
    print('18.Vas_ponyal.Seychas_vashe_zadanie')
elif a==('понялвасстартовоеположениеиприработенаорбитетумблернателеграфеиназареприразделениитумблернасигнал'):
    print('19.Ponyal_vas.Startovoe_polozhenie')
elif a==('слышувасхорошокакменя'):
    print('20.Slishu_vas_horosho')
elif a==('конечнояработойнеоченьзанят'):
    print('21.Konechno')
elif a==('понялпонялпродолжай'):
    print('22.Ponyal_prodolzhai')
elif a==('васпонялуменятожеидётвсехорошосамочувствиехорошеесейчасбудутзакрыватьлюк1'):
    print('23.Luk№1')
elif a==('васслышухорошонемножкопотишеговоритекакпоняли'):
    print('24.Potishe')
elif a==('сейчасработалкнопкойнапультесейчасработаюкнопкойнаручкеуправленияработалсобеихкнопоквыслышитехорошокакпоняли'):
    print('25.Rabotal_na_pulte')
elif a==('понялвасправильнопроверяюпользованиепамяткойивозможностьсчитываниясигналовпроверилвсёнормально'):
    print('26.Pamyatka')
elif a==('понялвасбольшоеспасибопередайтеимсамыйгорячийотменя'):
    print('27.Goryachii')
elif a==('понялподготовкаизделиянормальноуменятожесамочувствиеинастроениенормальнокстартуготов'):
    print('28.Podgotovka_izdeliya')
elif a==('слышувасхорошознаюскемразговариваю'):
    print('29.Znayu_s_kem_razgovarivayu')
elif a==('понялтакяидумал'):
    print('30.Tak_i_dumal')
elif a==('прошудвадцатогонасвязьдвадцатыйкоролёв'):
    print('31.Proshu_dvadcatogo')
elif a==('прошупринадёжнойсвязинаактивномучасткесообщитьвремяпозжеилираньшедосекундыстартаеслитаковоебудет'):
    print('32.Pri_nadezhnoi_svayzi')
elif a==('понялвасправильнолюкоткрытпроверяютсигнализаторы'):
    print('33.Luk_otkrit')
elif a==('работаюнадэмш'):
    print('34.Rabotayu_na_demsh')
elif a==('васслышухорошокакменя'):
    print('20.Slishu_vas_horosho')
elif a==('пакетпроверилдотянутьсялегкосвободнокакпоняли'):
    print('35.Paket_proveril')
elif a==('уходаэтихвагоновнеслышубольношумбольшойслышувастолько'):
    print('36.Vagonyi')
elif a==('васпонялобъявлена50минутнаяготовность'):
    print('37.50minut')
elif a==('васслышухорошокрышкуужеочевиднокончаютзаворачивать'):
    print('38.Krishka')
elif a==('уменятожевсёхорошосамочувствиехорошеенастроениебодрое'):
    print('39.U_menya_vse_horosho')
elif a==('понялвас'):
    print('40.Ponyal_vas')
elif a==('еслиестьмузычкаможнонемножкопустить'):
    print('41.Muzichka')
elif a==('васпонялопускаютплощадкиобслуживаниянояшуманеслышунекоторыеколебанияощущаю'):
    print('42.Ploshadki')
elif a==('покамузыкинетнонадеюсьсейчасбудет'):
    print('43.Muziki_net')
elif a==('поканедали'):
    print('44.Poka_ne_dali')
elif a==('далипролюбовь'):
    print('45.Dali_pro_lyubov')
elif a==('музыкудаливсёхорошо'):
    print('46.Muziku_dali')
elif a==('понялсердечныйприветимслушаюутесоваотдушиландыши'):
    print('47.Serdechniy_privet')
elif a==('васпонялгерметичностьвпорядкеслышуинаблюдаюгерметичностьпроверилионичтототампостукиваютнемножко'):
    print('48.Germetichnost')
elif a==('васслышухорошосамочувствиехорошеенастроениебодроекстартуготов'):
    print('49.K_startu_gotov')
elif a==('хорошопролюбовьпоюттам'):
    print('50.Pro_lubov_pout')
elif a==('васпонялуменятожевсёхорошоспокоенсамочувствиехорошееприветребятамвсёвремячувствуюиххорошуюдружескуюподдержкуонивместесомной'):
    print('51.Druzheskaya_podderzhka')
elif a==('понялбольшоеспасибосердечноеспасибо'):
    print('52.Serdechnoe_spasibo')
elif a==('доложилиправильносамочувствиехорошеенастроениебодроекдальнейшейработеготов'):
    print('53.Dolozhili_pravilno')
elif a==('исходноеположениедлярегистрациифизиологическихфункцийзанял'):
    print('54.Fiziologicheskih_funkcii')
elif a==('васпонялбудутотводитьустановщик'):
    print('55.Ustanovshik')
elif a==('понялвасстрелаустановщикаотошланормально'):
    print('56.Strela_ustanovshika')
elif a==('понялвассейчассостартапереходятвбункерминутныйперерывзатемпередачубудетеосуществлятьчерезних'):
    print('57.Bunker')
elif a==('тожевсёпревосходнокакподанныммедицинысердцебьется'):
    print('58.Medicina')
elif a==('понялзначитсердцебьётсякакаясейчасготовность'):
    print('59.Serdce_betsya')
elif a==('васпонял15минутнаяготовностьодетьперчаткивыполняюперчаткиоделвсёнормально'):
    print('60.Perchatki_odel')
elif a==('магнитофоннаавтоматическуюиручнуюзаписьнеработаеточевиднокончиласьплёнкапрошуперемотать'):
    print('61.Magnitofon')
elif a==('понялвасидётперемоткапустьперемотаютвсюпленку'):
    print('62.Idet_peremotka')
elif a==('васпонялобъявлена10минутнаяготовностьгермошлемзакрылвсёнормальносамочувствиехорошеекстартуготов'):
    print('63.Germoshlem')
elif a==('васпонялобъявлена5минутнаяготовностьпоставитьгромкостьнаполнуюполнуюгромкостьввёл'):
    print('64.Gromkost')
elif a==('васпонялвсеидётнормальнозанятьисходноеположениедлярегистрациифизиологическихфункцийположениезанял'):
    print('65.Polozhenie_zanayl')
elif a==('яслышувасхорошоваспонялдоначалаоперацииосталосьещёпарочкаминутсамочувствиехорошеенастроениебодроекстартуготоввсёнормально'):
    print('66.Parochka_minut')
elif a==('васпонялминутнаяготовностьзанималисходноеположениезанялпоэтомунесколькозадержалсясответом'):
    print('67.Minuta')
elif a==(''):
    print('')
else:
    print('999.Vas_ne_ponyal')
