#!/usr/bin/python3
import tensorflow as tf
from tensorflow import keras
import numpy as np
from navec import Navec
from stop_words import get_stop_words
from scipy.spatial import distance

hierarchy_nodes_actions_classes = {
    ('медицина','03'):
        {('срочно','вызов скорой'):
            [('реанимация','вызов реанимации'),
             ('морг','вызов перевозки тела'),
             ('инсульт','вызов скорой'),
             ('инфаркт','вызов скорой'),
             ('труп','вызов перевозки тела'), 
             ('приступ','вызов скорой')],
        ('не срочно','ближайшую аптеку или поликлинику'):
            {('сердце','рекомендация лекарств/запись к кардиологу'):
                [('недостаточность','запись к кардиологу'),
                 ('аритмия','запись к кардиологу'),
                 ('учащенное сердцебиение','запись к кардиологу'),
                 ('боли в средце','список сердечных лекарств')]},
            ("спина",'список лекарств и запись к хирургу'):
                [('боль в спине','список мазей'),
                 ('поясница','список мазей'),
                 ('защемление','запись к хирургу'),
                 ('грыжа','запись к хирургу')], 
            ("простуда",'рекомендация лекарств'):
                [("температура",'жаропонижающее'),
                 ("насморк",'капли для носа'),
                 ("горло","лекарства от боли в горле, народные средства"),
                 ('кашель',"лекарства от кашля, горчичники"),
                 ("озноб",'жаропонижающее'),
                 ("сонливость",'сон и отдых'),
                 ("ангина",'антибиотики'),
                 ("грипп",'жаропонижающее')],
            ("самочувствие",'рекомендация'):
                [("диабет",'инсулин'),
                 ("сахар",'инсулин'),
                 ("тошнота","лекарства от отравления"),
                 ('отравление',"лекарства от отравления"),
                 ('температура',"жаропонижающее"),
                 ('давление',"лекарства от давления"),
                 ('головокружение','запись к терапевту'),
                 ('нервы','успокоительное'),
                 ('усталось','отдых и сон'),
                 ('слабость','отдых и сон')],
            ("желудок",'ближайшая аптека, консультация гастроэнтегролога'):
                [('изжога','лекарства от изжоги'),
                 ('рвота','лекарства для водно-солевого баланса'),
                 ('отравление','лекарства от отравления'),
                 ('диарея','лекарства от диареи'),
                 ('язва','консультация гастроэнтегролога'),
                 ('вздутие','лекарства от диареи')],
            ('травмы','ближайший травмпункт или самолечение'):
                [('перелом','ближайший травмпункт'),
                 ('ушиб','список мазей от ушибов'),
                 ('синяк','список мазей от ушибов'),
                 ('вывих','ближайший травмпункт'),
                 ('растяжение','ближайший травмпункт'),
                 ('трещина','ближайший травмпункт')]
         },
    ('полиция','02'):{
        ('срочно','вызов специального наряда'):
            {('ограбление','вызов вооруженного наряда'):
                [('вооруженное','вызов вооруженного наряда'),
                 ('заложники','вызов вооруженного наряда'),
                 ('шантаж','вызов вооруженного наряда')],
            ('терроризм','вызов ОМОНа'):
                [('заложники','вызов ОМОНа'),
                 ('захват территории','вызов ОМОНа'),
                 ('детонация','вызов саперов'),
                 ('бомба','вызов саперов'),
                 ('жертвы','вызов ОМОНа')],
            ('убийство','вызов судмедэкспертов,патологоанатомов'):
                [('кровь','вызов судмедэкспертов'),
                 ('огнестрельное','вызов вооруженного наряда и реанимации'),
                 ('ножевое','вызов реанимации'),
                 ('ранение','вызов реанимации'),
                 ('смерть','вызов перевозки тела'),
                 ('выстрел','вызов вооруженного наряда')]
        },
        ('не срочно','обращение в полицию'):
            {('суд','ближайший районный суд'):
                 [('разбирательство','ближайший районный суд'),
                  ('иск','ближайший районный суд'),
                  ('компенсация','ближайшее отделение'),
                  ('полномочия','ближайшее отделение')],
            ('кража','ближайшее отделение'):
                [('мелкие','заявление о краже'),
                 ('документы','миграционная служба'),
                 ('крупные','заявление о краже'),
                 ('драгоценности','заявление о краже'),
                 ('угон','заявление об угоне')] ,
            ('взлом','ближайшее отделение'):
                 [('вынос','заявление о краже'),
                  ('драгоценности','заявление о краже'),
                  ('сейф','заявление о краже')],
            ('хулиганство','вызов полиции'):
                [('провокация','вызов полиции'),
                 ('шантаж','вызов полиции'),
                 ('порча имущества','заявление в полиции'),
                 ('вандализм','вызов полиции'),
                 ('граффити','вызов полиции')],
             ('увечия','вызов полиции и скорой'):
                [('телесные повреждения','вызов полиции, заявление в участок'),
                 ('холодное оружие','вызов скорой и полиции'),
                 ('огнестрельное раненение','вызов скорой и полиции'),
                 ('избиение','вызов полиции'),
                 ('шантажирование','обращение в ближайший участок')]
            },
    },
    ('служба спасения','04'):{
        ('срочно',"вызов МЧС"):
            {('стихийные бедствия',"вызов МЧС"):
                [('смерч',"рекомендация укрыться, вызов МЧС"),
                ('тайфун',"рекомендация по эвакуации, вызов МЧС"),
                ('цунами',"рекомендация по эвакуации, вызов МЧС"),
                ('ураган',"рекомендация укрыться, вызов МЧС"),
                ('лавина',"вызов спасателей и поисковой службы"),
                ('потоп',"вызов службы спасения на воде"),
                ('наводнение',"вызов службы спасения на воде")],
            ('эвакуация',"вызов эвакуационной службы"):
                [('лес',"спасательный вертолет"),
                ('пустыня',"спасательный вертолет"),
                ('горы',"спасательный вертолет"),
                ('вода',"вызов службы спасения на воде")]},
        ('не срочно',"рекомендации по поведению"):{
            ('погода','рекомендации укрыться'):
                [('молния',"укрыться, найти громоотвод"),
                 ('засуха',"находиться около воды"),
                 ('жара',"находиться в тени, больше пить"),
                 ('холод',"не выходить из дома"),
                 ('метель',"не выходить из дома"),
                 ('дождь',"укрыться под навесом"),
                 ('град',"укрыться под навесом")],
            ('технические неисправности','вызов нужной службы'):
                [('застрял в лифте',"вызов службы лифтов"),
                 ('заклинила дверь',"вызов службы спасения"),
                 ('сработала тревога',"следовать указаниям, не паниковать"),
                 ('вырубило электричество',"вызов службы ЖКХ"),
                 ('связь или интернет',"вызов оператора провайдера"),
                 ('течет кран, протечка',"вызов сантехника"),
                 ("проводка","перекрыть подачу электричества"),
                 ('короткое замыкание',"перекрыть подачу электричества")]
            },
    ('пожар','01'):
        {('огонь',"вызов пожарных"):
            [('горит дом',"покинуть здание,вызов пожарных"),
             ('короткое замыкание',"перекрыть подачу электричества"),
             ("взрыв","вызов пожарных,вызов саперов"),
             ("газ","перекрыть газ, избегать огня")],
         ('пожарная тревога',"не паниковать, следовать указаниям"):
            [('ложная тревога',"спокойно заниматься своими делами"),
             ('короткое замыкание',"перекрыть подачу электричества"),
             ("учебная тревога","спокойно заниматься своими делами"),
             ("гарь","проверить источник запаха"),
             ("задымление","проверить источник дыма"),
             ("дым","проверить источник дыма")]},
    },   
    ('дорожное происшествие',''):{
        ('не срочно',"рекомендации по поведению, вызов службы ДТП"):
            {('трасса',"вызов службы ДТП"):
                [('авария',""),
                ('заправка',""),
                ('АЗС',""),
                ('бензин',""),
                ('поломка',""),
                ('фура',""),
                ('встречка',""),
                ('превышение скорости',""),
                ('красный свет',"")],
            ('бездорожье',"вызов службы спасения"):
                [('увязло авто',"вытолкать авто, вызвать эвакуатор"),
                ('заглохла машина',"вызвать эвакуатор"),
                ('потеря пути',"вызов спасателей, ориентация по небу")]},
        ('срочно',"вызов службы ДТП"):{
            ('дорога',"вызов службы ДТП и скорой помощи"):
                [('авария с жертвами',"вызов полиции и реанимации"),
                ('взрыв авто',"вызов пожарных и реанимации"),
                ('авто горит',"вызов пожарных и скорой"),
                ('сбила машина',"вызов реанимации и службы ДТП"),
                ('сбили животное',"вызов службы ДТП"),
                ('лобовое столкновение',"вызов реанимации и службы ДТП"),
                ('потеря управлением',"вызов скорой и службы ДТП"),
                ('отказ тормозов',"вызов скорой и службы ДТП"),
                ('вылет за обочину',"вызов скорой и службы ДТП")],
            ('бездорожье',"вызов службы спасения"):
                [('запрос эвакуации',"вызов службы эвакуации и поисковиков"),
                ('сигнал SOS',"вызов службы спасения")]},
    },  
    ('начало или конец диалога',''):
        {('приветствие',"начать диалог, поприветсвовать пользователя"):
            [('привет',"поприветсвовать пользователя"),
             ('здравствуйте',"поприветсвовать пользователя"),
             (".",'уточнить, хочет ли человек начать диалог'),
             ('/start',"turn on"),
             ('хай',"поприветсвовать пользователя"),
             ("йоу","поприветсвовать пользователя"),
             ('ку',"поприветсвовать пользователя")],
         ('прощание',"уточнить о конце диалога, попрощаться"):
            [('спасибо',"спросить, нужна и еще помощь"),
             ('счастливо',"попрощаться, спящий режим"),
             ('до свидания',"попрощаться, спящий режим"),
             ('благодарю','спросить, нужна и еще помощь'),
             ('пока',"попрощаться, спящий режим"),
             ("/stop","turn off")]},
    ('неопознанный запрос',''):
        {('не найден класс',"уточнить запрос, подобрать класс из имеющихся"):
            [('не то',"уточнить запрос"),
             ('другое',"уточнить запрос"),
             ("не ответили",'уточнить запрос')],
         ('нет правильных рекомендаций',"уточнить запрос, подобрать рекомендации из имеющихся"):
            [('пробовал уже',"уточнить запрос, предложить выбрать из списка, кроме последнего"),
             ('другое',"уточнить запрос, предложить выбрать из списка, кроме последнего"),
             ("не ответили",'уточнить запрос')]}
}   

lstm = keras.models.load_model('lstm_model/lstm_for_NLP_10ep.tf')  #, custom_objects=None, compile=True, options=None)
navec = Navec.load('navec_lib.tar')
stop_words = get_stop_words('russian')

def go_further(ans,dicts):
    if isinstance(dicts , dict):
        for x,y in dicts.items():
            if x[0]==ans:
                print('Выберите один из наиболее подходящих Вам случаев:')
                try:print(list(y.keys()))
                except:print(list(y))
                return y
        print('ничего не подходит из вашего сообщения!')
    # elif isinstance(dicts , list):
    #     for y in dicts:
    #         if y[0]==ans:
    #             print('Выберите один из наиболее подходящих Вам случаев:')
    #             print(y[1])
    #             return y[1]
    elif isinstance(dicts , list):
        for y in dicts:
            if y[0]==ans:
                print('Достигнуто максимально возможное уточнение в данном режиме!')
                print('Предлагаем Вам следующее действие:')
                print(y[1])
                return y
                
def answer(dicts,phrase):
    pred = lstm.predict([phrase])
    if pred< 0.5:
        print('Введен нейтральный контекст, уточните категорию запроса: ')
        for key in list(dicts.keys())[:-2]:
            print(key[0]+'\n')
        return
    else:
        #phrase ='Пока'#'изжога и дискомфорт в животе '#input()#'меня сбила машина'#input()
        phrase_emb = np.asarray([navec[word] for word in phrase.split() if word in navec and word not in stop_words]).mean(axis=0)
        if len(phrase_emb)==0: 
            print('Введен текст без смысловой нагрузки, уточните запрос')
            return
        else:
            distances,keys_of_dist = [],[]
            flag_res = 1
            cur_dict = dicts
            nodes = []
            while flag_res:
                min_val = 2
                min_key = "неизвестно"
                for key,val in cur_dict.items():
                    if key[0] is not None:
                        result = np.asarray([navec[word] for word in key[0].split() if word in navec and word not in stop_words])
                        if len(result) != 0:
                            key_emb = result.mean(axis=0)
                            if distance.cosine(key_emb, phrase_emb) < min_val:
                                min_key = key
                                min_val = distance.cosine(key_emb, phrase_emb)
                        else:
                            print('Введен текст без смысловой нагрузки, уточните запрос')
                            return
                            
                cur_dict = cur_dict[min_key]
                nodes.append((min_key,min_val))
                if not isinstance(cur_dict, dict):
                    flag_res = 0      
                    min_val = 2
                    min_key = "неизвестно"
                    for pair in cur_dict: #уже не dict, а tuple
                        if pair[0] is not None:
                            result = np.asarray([navec[word] for word in pair[0].split() if pair[0] is not None and word in navec and word not in stop_words])
                            if len(result) != 0:
                                key_emb = result.mean(axis=0)
                                if distance.cosine(key_emb, phrase_emb) < min_val:
                                    min_key = pair[0]
                                    min_val = distance.cosine(key_emb, phrase_emb)
                    nodes.append((min_key,min_val))
    if nodes[0][0][0] == 'неопознанный запрос':
        print( 'не удалось распознать запрос, выберите категорию из:\n' + '\n'.join([key[0] for key in list(dicts.keys())[:-2]]))
        ans = input()
        #for i in range(len(dicts.items())-2):
        while 1:
        #for x,y in dicts.items():
            dicts_new = go_further(ans,dicts)
            if dicts_new is not None:
                dicts = dicts_new
            else:
                print("выберите строго из списка!")
            if  isinstance(dicts , tuple): break
            ans = input()
    else:
        return nodes

phase = 'я тону спасите помогите'
#phase = 'хахаха'
#phase = 'срочно эвакуировать'
print(answer(hierarchy_nodes_actions_classes,phase))
#print(lstm.predict(['привет']))
#print(lstm.predict(['давай поболтаем']))
#print(answer(hierarchy_nodes_actions_classes, 'срочно эвакуатор'))
