import numpy as np
from navec import Navec
from nltk.corpus import stopwords
from scipy.spatial import distance
from transformers import BertForSequenceClassification, AutoTokenizer
from torch.utils.data import DataLoader
import torch
from torch.nn.functional import softmax
import pickle


# 2) Все знаки должны стоять отдельно друг от друга !!!
# Первая фраза ('Как слышите меня?', 'Слышу хорошо .'),
frase_array = [('Как слышите меня ? ','Вас слышу хорошо . '),
('Приступайте к проверке скафандра . Как поняли меня ? ',
 'Вас понял : приступать к проверке скафандра . Через 3 минуты . Сейчас занят .'),
('Вас понял . ', 'Проверку скафандра закончил .'),
('Вас понял . Проверить УКВ - связь', ' '),
('Как слышите меня ?', 'Как меня слышите ?'),
('Слышу Вас отлично , как меня слышите ?',
 'Вас слышу очень слабо , у меня горит светозвуковая передача на доске . Очевидно , происходит списывание с магнитофона . Как меня поняли ?'),
('Вас понял , слышу Вас отлично .', 'Вас не понял . Выключите , пожалуйста , музыку , если можно .'),
('Вас понял , сейчас . Слышу Вас отлично . ', ' '),
('Как меня слышите ? Передача музыки идёт через 2-й КВ канал .', 'Всё сделано . Слышу Вас хорошо .'),
('Я понял Вас . По каналу КВ - 2 приём хороший , слышу Вас хорошо . ',
 'Работаю на ДЭМШ ( ДЭМШ - динамический электромагнитный микрофон шлема ) . Даю счет : 1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10 . '),
(' Вас понял отлично , продолжайте работать . ', 'Вас понял . Проверка связи . 1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9, 10 . Как слышите ? '),
('Понял Вас отлично . Слышу хорошо . Как меня слышите ? ',
 'Работаю на магнитофоне . 1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10 . Вас слышу хорошо . Работаю на ДЭМШ . 1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10 . Как поняли ?'),
('Слышу отлично . Вас понял .', 'Приём на телефон .'),
('Как чувствуете себя , Юрий Алексеевич ?',
 'Чувствую себя превосходно . Проверка телефонов и динамиков нормально , перехожу на телефон .'),
('Понял Вас . Дела у нас идут нормально , машина готовится нормально , всё хорошо .', 'Понял . Я так и знал .'),
('Понял Вас . Хорошо , всё нормально .',
'Проверку связи закончил . Как поняли ? Исходное положение тумблеров на пульте управления заданное . Глобус на месте разделения , широта северная 63°, долгота восточная 97°, коррекция цифра 710, время разделения 9 часов 18 мин. 07 сек.; подвижный индекс ПКРС (ПКРС — прибор контроля режима спуска) находится в исходном положении - первые сутки 7. Давление в кабине единица, влажность 65%, температура 19°, давление в отсеке 1,2, давление в системе ручной ориентации 175, первой автоматической ориентации 155, второй автоматической ориентации 157, давление в баллоне ТДУ (ТДУ — тормозная двигательная установка) 320 атмосфер. Самочувствие хорошее, к старту готов. Как поняли?'),
('Понял Вас отлично . Данные Ваши все принял , подтверждаю . Готовность к старту принял . У нас всё идет нормально .', ' '),
('Как слышите меня ? Мне нужно Вам передать .', 'Вас слышу хорошо .'),
('Юрий Алексеевич , я хочу Вам просто напомнить, что после минутной готовности пройдет минуток шесть , прежде чем начнется полёт . Так что Вы не волнуйтесь .',
'Понял Вас . Совершенно спокоен .'),
('Ну отлично , прекрасно . После минутной готовности шесть минуток будет , так сказать , всяких дел . Передаю трубку председателю .', ' '),
('Говорит с Вами Руднев . Юрий Алексеевич , как у Вас самочувствие , что нового кругом у Вас , что Вы видите через иллюминаторы ?',
'(не слышал , вёл встречную передачу) . . . всё в порядке . Говорите, как поняли ?'),
('Поняли Вас хорошо . Председатель Вас слышал . У нас всё нормально идёт .', ' '),
('Юра , как дела ?',  'Как учили ( смех ) .'),
('Ну , добро , добро , давай . Ты понял , кто с тобой говорит ?', 'Понял — Ландыш (смех . Ландышем назван космонавт Попович П . Р . ) '),
('Сейчас с тобой будут говорить : ( Быков ) : Я прошу , если у Вас есть время , подключить передатчики КВ и поговорить , дать отсчёт примерно до 20 . Если у Вас есть время , если Вы не заняты , сообщите . Как поняли ? Юра , только начинайте через минуту примерно . Понял ?',
 'Вас понял . Сейчас Ваше задание выполню .'),
('При разделении тумблер возьмите на себя .',
 'Понял Вас . Стартовое положение и при работе на орбите тумблер на телеграфе и на « Заре » . При разделении , тумблер на сигнал .'),
('Поняли тебя . Правильно , Юра .', ' '),
('Как слышите ?', 'Слышу Вас хорошо . Как меня ?'),
('Слышу тебя отлично . Юра , ты сейчас занят ?', 'Конечно , я работой не очень занят .'),
('Нашёл продолжение « Ландышей » . Понял ?', 'Понял , понял - продолжай.'),
('Споём сегодня вечером . ', ' '),
('У нас всё идет отлично . Как чувствуете ?',
 'Вас понял . У меня тоже идёт все хорошо , самочувствие хорошее , сейчас будут закрывать люк № 1 .'),
('Как слышите ? Проверяю связь из бункера .', 'Вас слышу хорошо . Немножко потише говорите . Как поняли ? '),
('Вас поняли .', ' '),
('Передайте , Вы работали по КВ по одной или по обеим кнопкам ? ',
'Сейчас работал кнопкой на пульте . Сейчас работаю кнопкой на ручке управления . Работал с обеих кнопок . Вы слышите хорошо ? Как поняли ?'),
('Понял тебя . Хорошо слышу тебя обеими .', ' '),
('Проверьте удобства пользования памяткой и видимость кодовой таблицы на « гастрономе » . Как поняли ?',
'Понял Вас правильно , проверяю . Пользование памяткой и возможность считывания сигналов проверил , всё нормально .'),
('Понял Вас . Ну , отлично , молодец .', ' '),
(' Юра , тебе привет коллективный от всех ребят . Сейчас был у них . Как понял ?',  'Понял Вас . Большое спасибо . Передайте им самый горячий от меня .'),
('Добро .', ' '),
('Как меня слышите ?',  'Слышу Вас хорошо . Как меня ?'),
('Слышу Вас хорошо . Подготовка изделия идёт нормально . Всё отлично , Юра .',
'Понял . Подготовка изделия нормально . У меня тоже . Самочувствие и настроение нормально , к старту готов .'),
('Юрий Алексеевич , как слышите меня ?',  'Слышу Вас хорошо , знаю , с кем разговариваю .'),
('Понял .', ' '),
('Юрий Алексеевич , я хочу Вам напомнить , что я не буду давать слово « секунды » , а просто давать цифры примерно каждые полсотни , примерно : 50, 100, 150 и дальше. Понятно ?',
'Понял , так я и думал.'),
('Хорошо .', ' Прошу двадцатого на связь ( двадцатый - Королёв ).'),
('Двадцатый на связи .',
'Прошу при надёжной связи на активном участке сообщить время позже или раньше до секунды старта, если таковое будет .'),
('Юрий Алексеевич , у нас так получилось : после закрытия люка вроде один контактик не показал, что он прижался , поэтому мы , наверное , сейчас будем снимать люк и потом его поставим снова . Как поняли меня ?',
'Понял Вас правильно . Люк открыт , проверяют сигнализаторы .'),
('Ну , отлично , хорошо .', ' '),
('Объявлена готовность часовая . Продолжайте осмотр оборудования . Как поняли ?',
'Вас понял . Объявлена часовая готовность . Всё нормально , самочувствие хорошее , настроение бодрое , к старту готов .'),
('Ты сейчас работаешь на ларинге или ДЭМШе ? ( ДЭМШ — динамический электромагнитный микрофон шлема ) .', 'Работаю на ДЭМШ .'),
('Понял отлично тебя , Юра .', ' '),
('Проверяю связь . Как слышите ?', 'Вас слышу хорошо . Как меня ?'),
('Вас слышу отлично .', ' '),
('Пакет смотрел ? До него можно дотянуться ? Посмотри пакет и доложи .',
'Пакет проверил . Дотянуться легко , свободно . Как поняли ?'),
('Вас понял , хорошо .', ' '),
('Вот сейчас уходят железнодорожные вагоны . Интересно : Вы слышите или нет ?',
'Ухода этих вагонов не слышу : больно шум большой , слышу Вас только .'),
('Ясно , Вас понял', ' '),
('Объявлена 50 - минутная готовность .', 'Вас понял : объявлена 50 - минутная готовность .'),
('Как слышите меня ? Крышку уже начали ставить, наверно?',  'Вас слышу хорошо . Крышку уже, очевидно, кончают заворачивать.'),
('Понял Вас , у нас всё хорошо .', 'У меня тоже всё хорошо . Самочувствие хорошее , настроение бодрое .'),
(' Ну, очень хорошо . Только что справлялись из Москвы о Вашем самочувствии . Мы туда передали , что всё нормально .',' Понял Вас .'),
('Юра, ну, не скучаешь там ?',  'Если есть музычка, можно немножко пустить .'),
('Одну минутку .', ' '),
('Вы , наверно, сейчас слышите шум . Это опускают площадки обслуживания . На фермах работы все окончены . Как поняли ?',
'Вас понял : опускают площадки обслуживания , но я шума не слышу . Некоторые колебания ощущаю .'),
('Понятно , понятно . Всё нормально .', ' '),
('Станция « Заря » (« Заря » - наземная УКВ станция) , я « Заря - 1 » . Выполните просьбу « Кедра » . Дайте ему музычку , дайте ему музычку .', ' '),
('Вы слышали ? Отвечает « Заря » : постараюсь выполнить Вашу просьбу . Вот давайте музычку , а то скучно .', ' '),
('Ну , как? - Музыка есть ',  'Пока музыки нет, но, надеюсь, сейчас будет.'),
('Ну , ты слышал , как пообещали?', ' '),
('Ну , как музыку дали Вам , нет ?', 'Пока не дали .'),
('Понятно , это же музыканты : пока туда , пока сюда , не так - то быстро дело делается , как сказка сказывается , Юрий Алексеевич .',
'Дали про любовь .'),
('Дали музычку про любовь ? Это толково , Юрий Алексеевич , я считаю .', ' '),
('Юра , ну , что , дали музыку , да ?', 'Музыку дали , всё хорошо .'),
('Ну , добро , значит , тебе будет не так скучно .', ' '),
('Юра , ребята все довольны очень тем, что у тебя всё хорошо и всё нормально. Понял ?',
 'Понял . Сердечный привет им . Слушаю Утесова . От души - « Ландыши » .'),
('Ну , давай , давай , слушай .', ' '),
('Герметичность проверена - всё в норме , в полном порядке . Как поняли ? ',
'Вас понял: герметичность в порядке. Слышу и наблюдаю: герметичность проверили. Они что-то там постукивают немножко.'),
('Ну , вот и отлично , всё хорошо .', ' '),
('Смотрели сейчас Вас по телевидению - всё нормально , вид у Вас порадовал нас : бодрый . Как слышите меня?',
'Вас слышу хорошо . Самочувствие хорошее, настроение бодрое, к старту готов.'),
('Ну , отлично , хорошо . У нас идет всё нормально .', ' '),
('Юра , ну , сейчас не скучно ?',  'Хорошо . Про любовь поют там .'),
(' Ну как дела , Юра ? У нас всё нормально , идёт подготовка . Здесь хорошо идёт , без всяких запинок , без всего . Ребята сейчас едут на « Зарю » (« Заря » - наземная УКВ радиостанция ) .',
'Вас понял. У меня тоже всё хорошо: спокоен, самочувствие хорошее. Привет ребятам. Всё время чувствую их хорошую дружескую поддержку. Они вместе со мной.'),
('Ну , добро , добро , Юра .', ' '),
('Юра , тебе тоже все желают , все подходят и говорят , чтобы передать тебе всего , счастливого пути и всё , всё , всё , понял ? Всего хорошего . Все желают только добра .',
'Понял . Большое спасибо , сердечное спасибо .'),
('Говорит Руднев . Вашим здоровьем и самочувствием интересовались товарищи из Москвы . Передали , что Вы себя хорошо чувствуете и , значит , готовы к дальнейшим делам .',
'Доложили правильно . Самочувствие хорошее , настроение бодрое , к дальнейшей работе готов .'),
('Поняли тебя .', ' '),
('Займите исходное положение для регистрации физиологических функций .', 'Исходное положение для регистрации физиологических функций занял .'),
('Вас понял .', ' '),
('Сейчас будут отводить установщик . Как понял ?',  'Вас понял : будут отводить установщик .'),
('Стрела установщика отошла нормально . Как поняли ?', 'Понял Вас: стрела установщика отошла нормально.'),
('Юрий Алексеевич , мы сейчас вот эту переговорную точку переносим отсюда, со старта , в бункер . Так что у Вас будет пятиминутная пауза , а в бункер переходят Николай Петрович ( генерал Каманин Н.П.) и Павел Романович ( космонавт капитан Попович П.Р. ). Я остаюсь пока здесь до пятиминутной готовности . Но они будут транслировать , что я им буду говорить . Поняли меня ?',
'Понял Вас : сейчас со старта переходят в бункер, минутный перерыв, затем передачу будете осуществлять через них.'),
(' Ну , вот , всё нормально : сейчас отводим фермы , всё идет по графику , на машине всё идет хорошо .',
'Тоже всё превосходно . Как по данным медицины - сердце бьется ?'),
('Как меня слышите ?', ' Вас слышу хорошо . Как меня ?'),
('Вас слышу отлично . Пульс у Вас 64 , дыхание 24 . Всё идет нормально .', 'Понял . Значит, сердце бьётся. Какая сейчас готовность?'),
('15 - минутная готовность . Напоминаю : оденьте перчатки . Как поняли ?',  'Вас понял : 15-минутная готовность, одеть перчатки. Выполняю. Перчатки одел, всё нормально.'),
('Вас понял .', 'Магнитофон на автоматическую и ручную запись не работает: очевидно, кончилась плёнка. Прошу перемотать.'),
('Я Вас понял : передам команду . Идёт перемотка ленты . Горит ли у Вас лампочка ?', ' Понял Вас: идёт перемотка . Пусть перемотают всю пленку .'),
('Понял , всё в порядке .', ' '),
('Объявлена 10 - минутная готовность . Как у Вас гермошлем , закрыт ? Закройте гермошлем , доложите .',
'Вас понял : объявлена 10 - минутная готовность . Гермошлем закрыл . Всё нормально , самочувствие хорошее , к старту готов .'),
('Вас понял .', ' '),
('Готовность 5 мин . Поставьте громкость на полную , громкость на полную .',
'Вас понял: объявлена 5-минутная готовность, поставить громкость на полную. Полную громкость ввёл.'),
('Всё идёт нормально . Займите исходное положение для регистрации физиологических функций .',
'Вас понял. Все идёт нормально, занять исходное положение для регистрации физиологических функций. Положение занял.'),
('Вас понял .', ' '),
('У нас всё нормально . До начала наших операций - до минутной готовности - ещё пара минут . Как слышите меня ?',
'Я слышу Вас хорошо . Вас понял: до начала операции осталось ещё парочка минут. Самочувствие хорошее, настроение бодрое, к старту готов, всё нормально.'),
('Понял Вас , понял хорошо .', ' '),
('Минутная готовность . Как Вы слышите ?',
'Вас понял : минутная готовность . Занимал исходное положение , занял , поэтому несколько задержался с ответом .'),
('Понял Вас .', ' '),
('Во время запуска можете мне не отвечать . Ответьте , как у Вас появится возможность , потому что я буду транслировать подробности .',
' Вас понял .')]

# Загрузка:
# 1) Для детекта эмоций
emotion_labels = ['Без эмоций', 'Радость', 'Грусть', 'Удивление', 'Страх', 'Гнев']
model = BertForSequenceClassification.from_pretrained('C:/Users/eliza/Рабочий стол/Курсовая работа/Курсовая_код/model_weight_2')
tokenizer = AutoTokenizer.from_pretrained('cointegrated/rubert-tiny2')
model.eval()

# 2)Загрузка выходных эмоций
with open('C:/Users/eliza/Рабочий стол/Курсовая работа/Курсовая_код/phrase_emotion', 'rb') as fp:
    output_emotion = pickle.load(fp)

# 3) NLP
navec = Navec.load('C:/Users/eliza/Рабочий стол/pythonProject/chatbot/navec_lib.tar')
stop_words = stopwords.words('russian')
marks = ['!', '.', '?', ',', '«', '»', '&', '#', '№',  '0', '-' , '1'
        ,'2', '3', '4', '5', '6', '7', '8', '9', '10', '15', '20', '50', '100', '150']

# Начало диалога
print('Для завершения программы воспользуйтесь комбинацией клавиш:'
      '\n - Ctrl + F2 (Pycharm);'
      '\n - Ctrl + С.')

print('НАЧАЛО ДИАЛОГА')
print('- Гагарин: \nКак слышите меня?')
phrase1_input = input('- ЦУП: \n')


try:
    while True:
        # Определение эмоций
        phrase_input = input(f' - ЦУП: \n ')
        tokens = tokenizer(phrase_input, return_tensors='pt')
        outputs = model(input_ids=tokens['input_ids'], token_type_ids=tokens['token_type_ids'],
                        attention_mask=tokens['attention_mask'])
        probs = softmax(outputs.logits, dim=1)
        max_val, max_idx = torch.max(probs, dim=1)
        print(f' ({emotion_labels[max_idx.item()]})')

        # NLP
        phrase_input_emb = np.asarray([navec[word] for word in phrase_input.lower().split()
                                 if (word in navec) and (word not in stop_words) and (word not in marks)]).mean(axis=0)

        # Поиск расстояния
        main_arr = []
        for text in frase_array:
            phrase = text[0]
            phrase_emb = np.asarray([navec[word] for word in phrase.lower().split()
                                     if (word in navec) and (word not in marks)]).mean(axis=0)
            main_arr.append(phrase_emb)


        cosine_arr = [distance.cosine(phrase_emb, phrase_input_emb) for phrase_emb in main_arr]
        cosine_min = min(cosine_arr)
        index = cosine_arr.index(cosine_min)
        print(f'- Гагарин: \n{frase_array[index][1]} ({output_emotion[index]})')

except KeyboardInterrupt:
    print('Программа завершена.')
    exit()


